Revit 2024 API
ImportPlacement Enumeration
 An enumerated type listing possible placement modes for imported drawings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum ImportPlacement
Visual Basic
Public Enumeration ImportPlacement
Visual C++
public enum class ImportPlacement
Members
Member name | Description
Site |  Placement at Base Point. Useful for Revit links only. There must be a reference point in order for this option to be valid.
Origin |  Placement at the Origin. If reference point is provided, then the import is placed so the point is at the model's origin. If no point is provided, then the document's origin is matched with the model's origin.
Centered |  Placement at the Center. If reference point is provided, then the import is placed so the point is at the model's center. If no point is provided, then the document's center is matched with the model's origin.
Shared |  Placement with respect to the shared coordinates. Revit Building places the imported geometry according to its location with respect to the shared coordinates between the two files. There must be shared coordinates in a Revit document in order for this option to be valid.
See Also
Autodesk.Revit.DB Namespace